app/controllers/login_controller.rb

SELECT  "usuarios".* FROM "usuarios"  WHERE "usuarios"."matricula" = 12345 AND "usuarios"."senha" = '1234' LIMIT 1
---
  def create
  	usuario = Usuario.find_by matricula: params[:matricula], senha: params[:senha]