app/controllers/servico_controller.rb

  def index
    $a = Usuario.find(session[:user_id])
---
SELECT  "usuarios".* FROM "usuarios"  WHERE "usuarios"."id" = $1 LIMIT 1  [["id", 1]]